# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_library_set -name CommonTiming -timing {innovus/osu05_stdcells_expanded.tlf innovus/osu05_stdcells.tlf}
create_constraint_mode -name TimingConstraints -sdc_files {/home/ead/yihui/ece6250/MIPS32_Pipeline_CPU_Chip_Design/src/syn/MIPS32_CPU_top_scan.sdc} 
create_delay_corner -name corner_min -library_set {CommonTiming}
create_analysis_view -name view_hold -constraint_mode {TimingConstraints} -delay_corner {corner_min}
set_analysis_view -setup {view_hold} -hold {view_hold}

