###################################################################

# Created by write_sdc on Tue Nov 28 01:03:53 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_area 0
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports clk]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports rst_n]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[31]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[30]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[29]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[28]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[27]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[26]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[25]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[24]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[23]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[22]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[21]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[20]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[19]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[18]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[17]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[16]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[15]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[14]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[13]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[12]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[11]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[10]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[9]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[8]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[7]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[6]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[5]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[4]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[3]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[2]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[1]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{instruction[0]}]
set_fanout_load 8 [get_ports {inst_address[31]}]
set_fanout_load 8 [get_ports {inst_address[30]}]
set_fanout_load 8 [get_ports {inst_address[29]}]
set_fanout_load 8 [get_ports {inst_address[28]}]
set_fanout_load 8 [get_ports {inst_address[27]}]
set_fanout_load 8 [get_ports {inst_address[26]}]
set_fanout_load 8 [get_ports {inst_address[25]}]
set_fanout_load 8 [get_ports {inst_address[24]}]
set_fanout_load 8 [get_ports {inst_address[23]}]
set_fanout_load 8 [get_ports {inst_address[22]}]
set_fanout_load 8 [get_ports {inst_address[21]}]
set_fanout_load 8 [get_ports {inst_address[20]}]
set_fanout_load 8 [get_ports {inst_address[19]}]
set_fanout_load 8 [get_ports {inst_address[18]}]
set_fanout_load 8 [get_ports {inst_address[17]}]
set_fanout_load 8 [get_ports {inst_address[16]}]
set_fanout_load 8 [get_ports {inst_address[15]}]
set_fanout_load 8 [get_ports {inst_address[14]}]
set_fanout_load 8 [get_ports {inst_address[13]}]
set_fanout_load 8 [get_ports {inst_address[12]}]
set_fanout_load 8 [get_ports {inst_address[11]}]
set_fanout_load 8 [get_ports {inst_address[10]}]
set_fanout_load 8 [get_ports {inst_address[9]}]
set_fanout_load 8 [get_ports {inst_address[8]}]
set_fanout_load 8 [get_ports {inst_address[7]}]
set_fanout_load 8 [get_ports {inst_address[6]}]
set_fanout_load 8 [get_ports {inst_address[5]}]
set_fanout_load 8 [get_ports {inst_address[4]}]
set_fanout_load 8 [get_ports {inst_address[3]}]
set_fanout_load 8 [get_ports {inst_address[2]}]
set_fanout_load 8 [get_ports {inst_address[1]}]
set_fanout_load 8 [get_ports {inst_address[0]}]
set_load -pin_load 0.1 [get_ports {inst_address[31]}]
set_load -pin_load 0.1 [get_ports {inst_address[30]}]
set_load -pin_load 0.1 [get_ports {inst_address[29]}]
set_load -pin_load 0.1 [get_ports {inst_address[28]}]
set_load -pin_load 0.1 [get_ports {inst_address[27]}]
set_load -pin_load 0.1 [get_ports {inst_address[26]}]
set_load -pin_load 0.1 [get_ports {inst_address[25]}]
set_load -pin_load 0.1 [get_ports {inst_address[24]}]
set_load -pin_load 0.1 [get_ports {inst_address[23]}]
set_load -pin_load 0.1 [get_ports {inst_address[22]}]
set_load -pin_load 0.1 [get_ports {inst_address[21]}]
set_load -pin_load 0.1 [get_ports {inst_address[20]}]
set_load -pin_load 0.1 [get_ports {inst_address[19]}]
set_load -pin_load 0.1 [get_ports {inst_address[18]}]
set_load -pin_load 0.1 [get_ports {inst_address[17]}]
set_load -pin_load 0.1 [get_ports {inst_address[16]}]
set_load -pin_load 0.1 [get_ports {inst_address[15]}]
set_load -pin_load 0.1 [get_ports {inst_address[14]}]
set_load -pin_load 0.1 [get_ports {inst_address[13]}]
set_load -pin_load 0.1 [get_ports {inst_address[12]}]
set_load -pin_load 0.1 [get_ports {inst_address[11]}]
set_load -pin_load 0.1 [get_ports {inst_address[10]}]
set_load -pin_load 0.1 [get_ports {inst_address[9]}]
set_load -pin_load 0.1 [get_ports {inst_address[8]}]
set_load -pin_load 0.1 [get_ports {inst_address[7]}]
set_load -pin_load 0.1 [get_ports {inst_address[6]}]
set_load -pin_load 0.1 [get_ports {inst_address[5]}]
set_load -pin_load 0.1 [get_ports {inst_address[4]}]
set_load -pin_load 0.1 [get_ports {inst_address[3]}]
set_load -pin_load 0.1 [get_ports {inst_address[2]}]
set_load -pin_load 0.1 [get_ports {inst_address[1]}]
set_load -pin_load 0.1 [get_ports {inst_address[0]}]
set_max_fanout 1 [get_ports clk]
set_max_fanout 1 [get_ports rst_n]
set_max_fanout 1 [get_ports {instruction[31]}]
set_max_fanout 1 [get_ports {instruction[30]}]
set_max_fanout 1 [get_ports {instruction[29]}]
set_max_fanout 1 [get_ports {instruction[28]}]
set_max_fanout 1 [get_ports {instruction[27]}]
set_max_fanout 1 [get_ports {instruction[26]}]
set_max_fanout 1 [get_ports {instruction[25]}]
set_max_fanout 1 [get_ports {instruction[24]}]
set_max_fanout 1 [get_ports {instruction[23]}]
set_max_fanout 1 [get_ports {instruction[22]}]
set_max_fanout 1 [get_ports {instruction[21]}]
set_max_fanout 1 [get_ports {instruction[20]}]
set_max_fanout 1 [get_ports {instruction[19]}]
set_max_fanout 1 [get_ports {instruction[18]}]
set_max_fanout 1 [get_ports {instruction[17]}]
set_max_fanout 1 [get_ports {instruction[16]}]
set_max_fanout 1 [get_ports {instruction[15]}]
set_max_fanout 1 [get_ports {instruction[14]}]
set_max_fanout 1 [get_ports {instruction[13]}]
set_max_fanout 1 [get_ports {instruction[12]}]
set_max_fanout 1 [get_ports {instruction[11]}]
set_max_fanout 1 [get_ports {instruction[10]}]
set_max_fanout 1 [get_ports {instruction[9]}]
set_max_fanout 1 [get_ports {instruction[8]}]
set_max_fanout 1 [get_ports {instruction[7]}]
set_max_fanout 1 [get_ports {instruction[6]}]
set_max_fanout 1 [get_ports {instruction[5]}]
set_max_fanout 1 [get_ports {instruction[4]}]
set_max_fanout 1 [get_ports {instruction[3]}]
set_max_fanout 1 [get_ports {instruction[2]}]
set_max_fanout 1 [get_ports {instruction[1]}]
set_max_fanout 1 [get_ports {instruction[0]}]
create_clock [get_ports clk]  -period 20  -waveform {0 10}
set_clock_latency 0.3  [get_clocks clk]
set_input_delay -clock clk  2  [get_ports clk]
set_input_delay -clock clk  2  [get_ports rst_n]
set_input_delay -clock clk  2  [get_ports {instruction[31]}]
set_input_delay -clock clk  2  [get_ports {instruction[30]}]
set_input_delay -clock clk  2  [get_ports {instruction[29]}]
set_input_delay -clock clk  2  [get_ports {instruction[28]}]
set_input_delay -clock clk  2  [get_ports {instruction[27]}]
set_input_delay -clock clk  2  [get_ports {instruction[26]}]
set_input_delay -clock clk  2  [get_ports {instruction[25]}]
set_input_delay -clock clk  2  [get_ports {instruction[24]}]
set_input_delay -clock clk  2  [get_ports {instruction[23]}]
set_input_delay -clock clk  2  [get_ports {instruction[22]}]
set_input_delay -clock clk  2  [get_ports {instruction[21]}]
set_input_delay -clock clk  2  [get_ports {instruction[20]}]
set_input_delay -clock clk  2  [get_ports {instruction[19]}]
set_input_delay -clock clk  2  [get_ports {instruction[18]}]
set_input_delay -clock clk  2  [get_ports {instruction[17]}]
set_input_delay -clock clk  2  [get_ports {instruction[16]}]
set_input_delay -clock clk  2  [get_ports {instruction[15]}]
set_input_delay -clock clk  2  [get_ports {instruction[14]}]
set_input_delay -clock clk  2  [get_ports {instruction[13]}]
set_input_delay -clock clk  2  [get_ports {instruction[12]}]
set_input_delay -clock clk  2  [get_ports {instruction[11]}]
set_input_delay -clock clk  2  [get_ports {instruction[10]}]
set_input_delay -clock clk  2  [get_ports {instruction[9]}]
set_input_delay -clock clk  2  [get_ports {instruction[8]}]
set_input_delay -clock clk  2  [get_ports {instruction[7]}]
set_input_delay -clock clk  2  [get_ports {instruction[6]}]
set_input_delay -clock clk  2  [get_ports {instruction[5]}]
set_input_delay -clock clk  2  [get_ports {instruction[4]}]
set_input_delay -clock clk  2  [get_ports {instruction[3]}]
set_input_delay -clock clk  2  [get_ports {instruction[2]}]
set_input_delay -clock clk  2  [get_ports {instruction[1]}]
set_input_delay -clock clk  2  [get_ports {instruction[0]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[31]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[30]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[29]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[28]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[27]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[26]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[25]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[24]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[23]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[22]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[21]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[20]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[19]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[18]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[17]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[16]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[15]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[14]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[13]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[12]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[11]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[10]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[9]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[8]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[7]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[6]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[5]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[4]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[3]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[2]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[1]}]
set_output_delay -clock clk  1.65  [get_ports {inst_address[0]}]
